blog/analyzing-opentracing-for-go.org
#+TITLE: Analyzing Opentracing for Go
#+DATE: 2016-06-06
#+TAGS: tech
#+OPTIONS: toc:nil

I'm in the middle of designing the architecture for an audit log for [[https://jujucharms.com][Juju]], and some of my colleagues suggested [[http://opentracing.io/][OpenTracing]]. I flipped through the site and it looks like it might meet our needs quite nicely, and so I've set out to do a deeper analysis to make sure it's something that is a good fit. I'm hoping this post will serve as a place I can point my coworkers for that analysis, as well as to help anyone else considering utilizing this project.

Juju is written in Go, and so I'll be taking a look at the [[https://github.com/opentracing/opentracing-go][Go implementation]] of the project. I'm going to ignore any kind of general overview as the project's web page does a pretty good job of that. Instead this post will focus on the things that aren't immediately apparent: ease of use, and performance.

With that said, on to the analysis!

* Key Concepts

- *span*: A logical unit of work in the system.
- *baggage*: Information intended to be carried on to subsequent spans.
- *tracer*: Manages spans. A *trace* is a tree of spans.
- *recorder*: Records span information to the system's backing-store.

* Sanity Check

First of all, the [[https://github.com/opentracing/opentracing-go/blob/master/LICENSE][license]] is MIT. No issues there.

At the time of this post, the project has 110 stars on GitHub, the last merge was 14 days ago, and there are 5 open issues, 15 closed. As far as project activity goes, looks OK.

Juju also has Python bindings to its API, so ideally any tracing standard will be polyglot implementation. It looks like Opentrace does have Python binding, and it also looks like Java, JavaScript, Objective C, C++, PHP, and Ruby are in [[http://opentracing.io/integration/][various stages]] of support. We should be good to go.

* Performance

First the obvious question. If I'm going to be embedding a lot of spans, this needs to be fast. How quick is it to create and tear down a new span?

#+HEADERS: :main no :package "opentrace" :imports '("fmt" "testing" "github.com/opentracing/opentracing-go")
#+BEGIN_SRC go :exports code :mkdirp yes :tangle /tmp/analyzing-opentrace/b_span_creation_test.go
  func BenchmarkSpanCreation(b *testing.B) {
      for i := b.N; i >= 0; i-- {
          s := opentracing.StartSpan(fmt.Sprintf("span %d", i))
          s.Finish()
      }
  }
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :exports both :cache yes
  go test /tmp/analyzing-opentrace/b_span_creation_test.go
#+END_SRC

#+RESULTS[c9e6913cbd4306212ab469c50b8390e6873281af]:
| ok | command-line-arguments | 0.003s |

Looks to be fast enough to be non-impactful. What about creating spans from other spans?

#+HEADERS: :main no :package "opentrace" :imports '("fmt" "testing" "github.com/opentracing/opentracing-go")
#+BEGIN_SRC go :exports code :mkdirp yes :tangle /tmp/analyzing-opentrace/b_span_child_creation_test.go
  func BenchmarkChildSpanCreation(b *testing.B) {
      p := opentracing.StartSpan("parent-spam")
      defer p.Finish()
      for i := b.N; i >= 0; i-- {
          s := opentracing.StartChildSpan(p, fmt.Sprintf("child-span-%d", i))
          s.Finish()
      }
  }
#+END_SRC

#+BEGIN_SRC sh :exports both :cache yes
  go test /tmp/analyzing-opentrace/b_span_child_creation_test.go
#+END_SRC

#+RESULTS[2fefec69ea3c42565bd02dd078c82cb6a2c635f6]:
| ok | command-line-arguments | 0.026s |

Also reasonable. Our RPC system utilizes web sockets; if we were to inject span information, how much extra space could we expect it to take up?

#+HEADER: :imports '("fmt" "net/http" "github.com/opentracing/basictracer-go" "github.com/opentracing/opentracing-go")
#+BEGIN_SRC go :noweb yes :exports both :cache yes
  tracer := basictracer.New(nil)

  httpReq, _ := http.NewRequest("GET", "http://myservice/", nil)
  fmt.Printf("Header (before): %v\n", httpReq.Header)

  s := tracer.StartSpan("my-span")
  // defer s.Finish() <-- Normally we would call this to trigger writes by the recorder
  s.LogEvent("test event")
  s.SetBaggageItem("my-baggage", "current user")

  tracer.Inject(s, opentracing.TextMap, opentracing.HTTPHeaderTextMapCarrier(httpReq.Header))
  fmt.Printf("Header (after): %v\n", httpReq.Header)
#+END_SRC

#+RESULTS[50af8516713d4cfb1dc3865c421bdbc447b9f381]:
: Header (before): map[]
: Header (after): map[Ot-Tracer-Traceid:[7ab6ba52e1e748c1] Ot-Tracer-Spanid:[1b4c98c3b3f048aa] Ot-Tracer-Sampled:[false] Ot-Baggage-My-Baggage:[current+user]]

Looks pretty reasonable; just some information about the spans for the receiver to pick up the trace.

#+NAME: trivial-recorder
#+BEGIN_SRC go :exports none
  // TrivialRecorder implements the basictracer.Recorder interface.
  type TrivialRecorder struct {
      processName string
      tags        map[string]string
  }

  // NewTrivialRecorder returns a TrivialRecorder for the given `processName`.
  func NewTrivialRecorder(processName string) *TrivialRecorder {
      return &TrivialRecorder{
          processName: processName,
          tags:        make(map[string]string),
      }
  }

  // ProcessName returns the process name.
  func (t *TrivialRecorder) ProcessName() string { return t.processName }

  // SetTag sets a tag.
  func (t *TrivialRecorder) SetTag(key string, val interface{}) *TrivialRecorder {
      t.tags[key] = fmt.Sprint(val)
      return t
  }

  // RecordSpan complies with the basictracer.Recorder interface.
  func (t *TrivialRecorder) RecordSpan(span basictracer.RawSpan) {
      fmt.Printf(
          "RecordSpan: %v[%v, %v us] --> %v logs. std context: %v; baggage: %v\n",
          span.Operation, span.Start, span.Duration, len(span.Logs),
          span.Context, span.Baggage)
      for i, l := range span.Logs {
          fmt.Printf(
              "    log %v @ %v: %v --> %v\n", i, l.Timestamp, l.Event, reflect.TypeOf(l.Payload))
      }
  }
#+END_SRC

* Integration with Juju

