blog/2016/06/06/analyzing-opentracing-for-go/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
  <title>Analyzing Opentracing for Go - Katherine Cox-Buday</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="author" content="Katherine Cox-Buday" />

  <!-- Mobile support -->
  <meta name="viewport" content="width=device-width, initial-scale=1">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <!-- <link rel="stylesheet" href="/media/css/prettify.css" type="text/css"> -->

  <!-- Latest compiled and minified CSS -->
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.1/css/bootstrap.min.css">
  <!-- Optional theme -->
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.1/css/bootstrap-theme.min.css">
  <!-- Latest compiled and minified JavaScript -->
  <link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.2.0/css/font-awesome.min.css" rel="stylesheet">
</head>

  <body>
    <div class="container">
      <div class="row">
        <div class="col-sm-9 blog-main">
          <div class="post">
  <div class="col-sm-3 right-align post-meta">
    <h3>&nbsp;<!-- Placeholder for alignment with post --></h3>
  </div>
  <div class="col-sm-9">
    <div class="post">
      <h3>Analyzing Opentracing for Go</h3>
      <p>
I'm in the middle of designing the architecture for an audit log for <a href="https://jujucharms.com/">Juju</a>, and some of my colleagues suggested <a href="http://opentracing.io/">OpenTracing</a>. I flipped through the site and it looks like it might meet our needs quite nicely, and so I've set out to do a deeper analysis to make sure it's something that is a good fit. I'm hoping this post will serve as a place I can point my coworkers for that analysis, as well as to help anyone else considering utilizing this project.
</p>

<p>
Juju is written in Go, and so I'll be taking a look at the <a href="https://github.com/opentracing/opentracing-go">Go implementation</a> of the project. I'm going to ignore any kind of general overview as the project's web page does a pretty good job of that. Instead this post will focus on the things that aren't immediately apparent: ease of use, and performance.
</p>

<p>
With that said, on to the analysis!
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Key Concepts</h2>
<div class="outline-text-2" id="text-orgheadline1">
<ul class="org-ul">
<li><b>span</b>: A logical unit of work in the system.</li>
<li><b>baggage</b>: Information intended to be carried on to subsequent spans.</li>
<li><b>tracer</b>: Manages spans. A <b>trace</b> is a tree of spans.</li>
<li><b>recorder</b>: Records span information to the system's backing-store.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Sanity Check</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
First of all, the <a href="https://github.com/opentracing/opentracing-go/blob/master/LICENSE">license</a> is MIT. No issues there.
</p>

<p>
At the time of this post, the project has 110 stars on GitHub, the last merge was 14 days ago, and there are 5 open issues, 15 closed. As far as project activity goes, looks OK.
</p>

<p>
Juju also has Python bindings to its API, so ideally any tracing standard will be polyglot implementation. It looks like Opentrace does have Python binding, and it also looks like Java, JavaScript, Objective C, C++, PHP, and Ruby are in <a href="http://opentracing.io/integration/">various stages</a> of support. We should be good to go.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Performance</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
First the obvious question. If I'm going to be embedding a lot of spans, this needs to be fast. How quick is it to create and tear down a new span?
</p>

<div class="org-src-container">

<pre class="src src-go">func BenchmarkSpanCreation(b *testing.B) {
    for i := b.N; i &gt;= 0; i-- {
        s := opentracing.StartSpan(fmt.Sprintf("span %d", i))
        s.Finish()
    }
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">go test /tmp/analyzing-opentrace/b_span_creation_test.go
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">ok</td>
<td class="org-left">command-line-arguments</td>
<td class="org-left">0.003s</td>
</tr>
</tbody>
</table>

<p>
Looks to be fast enough to be non-impactful. What about creating spans from other spans?
</p>

<div class="org-src-container">

<pre class="src src-go">func BenchmarkChildSpanCreation(b *testing.B) {
    p := opentracing.StartSpan("parent-spam")
    defer p.Finish()
    for i := b.N; i &gt;= 0; i-- {
        s := opentracing.StartChildSpan(p, fmt.Sprintf("child-span-%d", i))
        s.Finish()
    }
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">go test /tmp/analyzing-opentrace/b_span_child_creation_test.go
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">ok</td>
<td class="org-left">command-line-arguments</td>
<td class="org-left">0.026s</td>
</tr>
</tbody>
</table>

<p>
Also reasonable. Our RPC system utilizes web sockets; if we were to inject span information, how much extra space could we expect it to take up?
</p>

<div class="org-src-container">

<pre class="src src-go">tracer := basictracer.New(nil)

httpReq, _ := http.NewRequest("GET", "http://myservice/", nil)
fmt.Printf("Header (before): %v\n", httpReq.Header)

s := tracer.StartSpan("my-span")
// defer s.Finish() &lt;-- Normally we would call this to trigger writes by the recorder
s.LogEvent("test event")
s.SetBaggageItem("my-baggage", "current user")

tracer.Inject(s, opentracing.TextMap, opentracing.HTTPHeaderTextMapCarrier(httpReq.Header))
fmt.Printf("Header (after): %v\n", httpReq.Header)
</pre>
</div>

<pre class="example">
Header (before): map[]
Header (after): map[Ot-Tracer-Traceid:[7ab6ba52e1e748c1] Ot-Tracer-Spanid:[1b4c98c3b3f048aa] Ot-Tracer-Sampled:[false] Ot-Baggage-My-Baggage:[current+user]]
</pre>

<p>
Looks pretty reasonable; just some information about the spans for the receiver to pick up the trace.
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">Integration with Juju</h2>
